11/data/attachments/534244d5a8bc7062.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7fb622e7-19d7-4578-9585-8a3d2f768098</nif:username>
            <nif:friendToBeAdded>Patrick_benefit_Friend_90669_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>